In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn

In [3]:
np.random.seed(101)

In [9]:
df = pd.DataFrame(randn(5,4), index='A B C D E'.split(), columns='W X Y Z'.split())

In [10]:
df

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

In [11]:
df["W"]

A    0.386030
B    0.681209
C   -1.005187
D   -1.382920
E    0.992573
Name: W, dtype: float64

In [13]:
df[["W", "Z"]]

          W         Z
A  0.386030  0.230336
B  0.681209  1.939932
C -1.005187 -0.732845
D -1.382920 -2.141212
E  0.992573  1.292765

In [14]:
df.W

A    0.386030
B    0.681209
C   -1.005187
D   -1.382920
E    0.992573
Name: W, dtype: float64

In [15]:
type(df["W"])

pandas.core.series.Series

In [17]:
df["neu"] = df["W"] + df["Y"]

In [18]:
df

          W         X         Y         Z       neu
A  0.386030  2.084019 -0.376519  0.230336  0.009512
B  0.681209  1.035125 -0.031160  1.939932  0.650049
C -1.005187 -0.741790  0.187125 -0.732845 -0.818062
D -1.382920  1.482495  0.961458 -2.141212 -0.421462
E  0.992573  1.192241 -1.046780  1.292765 -0.054206

In [21]:
df.drop("neu", axis=1)

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

In [22]:
df

          W         X         Y         Z       neu
A  0.386030  2.084019 -0.376519  0.230336  0.009512
B  0.681209  1.035125 -0.031160  1.939932  0.650049
C -1.005187 -0.741790  0.187125 -0.732845 -0.818062
D -1.382920  1.482495  0.961458 -2.141212 -0.421462
E  0.992573  1.192241 -1.046780  1.292765 -0.054206

In [23]:
df.drop("neu", axis=1, inplace=True)

In [24]:
df

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

In [25]:
df.drop("E", axis=0)

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212

In [27]:
df.loc["A"]

W    0.386030
X    2.084019
Y   -0.376519
Z    0.230336
Name: A, dtype: float64

In [28]:
df.iloc[1]

W    0.681209
X    1.035125
Y   -0.031160
Z    1.939932
Name: B, dtype: float64

In [29]:
df.loc["B", "Y"]

-0.031160481493099617

In [30]:
df.loc[['A','B'], ['W','Y']]

          W         Y
A  0.386030 -0.376519
B  0.681209 -0.031160

In [31]:
df

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

In [32]:
df>0

       W      X      Y      Z
A   True   True  False   True
B   True   True  False   True
C  False  False   True  False
D  False   True   True  False
E   True   True  False   True

In [33]:
df[df>0]

          W         X         Y         Z
A  0.386030  2.084019       NaN  0.230336
B  0.681209  1.035125       NaN  1.939932
C       NaN       NaN  0.187125       NaN
D       NaN  1.482495  0.961458       NaN
E  0.992573  1.192241       NaN  1.292765

In [34]:
df["W"]>0

A     True
B     True
C    False
D    False
E     True
Name: W, dtype: bool

In [37]:
df[df["W"]>0][["Y", "X"]]

          Y         X
A -0.376519  2.084019
B -0.031160  1.035125
E -1.046780  1.192241

In [44]:
df[(df["W"]>0) & (df["Y"]>1)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [45]:
df[(df["W"]>0) | (df["Y"]>1)]

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
E  0.992573  1.192241 -1.046780  1.292765

In [46]:
df.reset_index()

  index         W         X         Y         Z
0     A  0.386030  2.084019 -0.376519  0.230336
1     B  0.681209  1.035125 -0.031160  1.939932
2     C -1.005187 -0.741790  0.187125 -0.732845
3     D -1.382920  1.482495  0.961458 -2.141212
4     E  0.992573  1.192241 -1.046780  1.292765

In [47]:
neuind = 'BY BW HH BB NH'.split()

In [48]:
df["Staaten"]=neuind

In [49]:
df

          W         X         Y         Z Staaten
A  0.386030  2.084019 -0.376519  0.230336      BY
B  0.681209  1.035125 -0.031160  1.939932      BW
C -1.005187 -0.741790  0.187125 -0.732845      HH
D -1.382920  1.482495  0.961458 -2.141212      BB
E  0.992573  1.192241 -1.046780  1.292765      NH

In [50]:
df.set_index("Staaten")

                W         X         Y         Z
Staaten
BY       0.386030  2.084019 -0.376519  0.230336
BW       0.681209  1.035125 -0.031160  1.939932
HH      -1.005187 -0.741790  0.187125 -0.732845
BB      -1.382920  1.482495  0.961458 -2.141212
NH       0.992573  1.192241 -1.046780  1.292765

In [51]:
df.set_index("Staaten", inplace=True)

In [52]:
df

                W         X         Y         Z
Staaten
BY       0.386030  2.084019 -0.376519  0.230336
BW       0.681209  1.035125 -0.031160  1.939932
HH      -1.005187 -0.741790  0.187125 -0.732845
BB      -1.382920  1.482495  0.961458 -2.141212
NH       0.992573  1.192241 -1.046780  1.292765

In [53]:
aussen = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
innen = [1, 2, 3, 1, 2, 3]
hier_index = list(zip(aussen, innen))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [55]:
hier_index = list(zip(aussen, innen))

In [56]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [57]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [58]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [59]:
df = pd.DataFrame(np.random.randn(6,2), index=hier_index, columns=['A','B'])

In [60]:
df

             A         B
G1 1 -1.467514 -0.494095
   2 -0.162535  0.485809
   3  0.392489  0.221491
G2 1 -0.855196  1.541990
   2  0.666319 -0.538235
   3 -0.568581  1.407338

In [62]:
df.loc['G1']

          A         B
1 -1.467514 -0.494095
2 -0.162535  0.485809
3  0.392489  0.221491

In [66]:
df.loc['G1'].loc[2]

A   -0.162535
B    0.485809
Name: 2, dtype: float64

In [68]:
df.index.names = ['Gruppe', 'Nummer']

In [69]:
df

                      A         B
Gruppe Nummer
G1     1      -1.467514 -0.494095
       2      -0.162535  0.485809
       3       0.392489  0.221491
G2     1      -0.855196  1.541990
       2       0.666319 -0.538235
       3      -0.568581  1.407338

In [70]:
df.xs('G1')

               A         B
Nummer
1      -1.467514 -0.494095
2      -0.162535  0.485809
3       0.392489  0.221491

In [73]:
df.xs(['G1', 1])

/tmp/ipykernel_51/2011919136.py:1: FutureWarning: Passing lists as key for xs is deprecated and will be removed in a future version. Pass key as a tuple instead.
  df.xs(['G1', 1])

A   -1.467514
B   -0.494095
Name: (G1, 1), dtype: float64

In [75]:
df.xs(1,level='Nummer')

               A         B
Gruppe
G1     -1.467514 -0.494095
G2     -0.855196  1.541990